{
  "metadata": {},
  "weight_map": {
    "vision_model.embeddings.patch_embedding.weight": "model-00001-of-00016.safetensors",
    "vision_model.embeddings.patch_embedding.bias": "model-00001-of-00016.safetensors",
    "vision_model.embeddings.dense_embedding.weight": "model-00001-of-00016.safetensors",
    "vision_model.embeddings.dense_embedding.bias": "model-00001-of-00016.safetensors",
    "fm_modules.vision_model_mot_gen.embeddings.patch_embedding.weight": "model-00001-of-00016.safetensors",
    "fm_modules.vision_model_mot_gen.embeddings.patch_embedding.bias": "model-00001-of-00016.safetensors",
    "fm_modules.vision_model_mot_gen.embeddings.dense_embedding.weight": "model-00001-of-00016.safetensors",
    "fm_modules.vision_model_mot_gen.embeddings.dense_embedding.bias": "model-00001-of-00016.safetensors",
    "fm_modules.timestep_embedder.mlp.0.weight": "model-00005-of-00016.safetensors",
    "fm_modules.timestep_embedder.mlp.0.bias": "model-00005-of-00016.safetensors",
    "fm_modules.timestep_embedder.mlp.2.weight": "model-00005-of-00016.safetensors",
    "fm_modules.timestep_embedder.mlp.2.bias": "model-00005-of-00016.safetensors",
    "fm_modules.fm_head.0.weight": "model-00005-of-00016.safetensors",
    "fm_modules.fm_head.0.bias": "model-00005-of-00016.safetensors",
    "fm_modules.fm_head.2.weight": "model-00005-of-00016.safetensors",
    "fm_modules.fm_head.2.bias": "model-00005-of-00016.safetensors",
    "fm_modules.noise_scale_embedder.mlp.0.weight": "model-00005-of-00016.safetensors",
    "fm_modules.noise_scale_embedder.mlp.0.bias": "model-00005-of-00016.safetensors",
    "fm_modules.noise_scale_embedder.mlp.2.weight": "model-00005-of-00016.safetensors",
    "fm_modules.noise_scale_embedder.mlp.2.bias": "model-00005-of-00016.safetensors",
    "language_model.model.embed_tokens.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.q_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.k_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.v_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.q_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.k_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.v_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.q_norm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.k_norm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.q_norm_hw.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.k_norm_hw.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.q_norm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.k_norm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.q_norm_hw_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.k_norm_hw_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.o_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.self_attn.o_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.input_layernorm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.post_attention_layernorm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.input_layernorm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.post_attention_layernorm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.mlp.gate_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.mlp.up_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.mlp.down_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.mlp_mot_gen.gate_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.mlp_mot_gen.up_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.0.mlp_mot_gen.down_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.q_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.k_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.v_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.q_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.k_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.v_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.q_norm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.k_norm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.q_norm_hw.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.k_norm_hw.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.q_norm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.k_norm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.q_norm_hw_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.k_norm_hw_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.o_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.self_attn.o_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.input_layernorm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.post_attention_layernorm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.input_layernorm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.post_attention_layernorm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.mlp.gate_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.mlp.up_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.mlp.down_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.mlp_mot_gen.gate_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.mlp_mot_gen.up_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.1.mlp_mot_gen.down_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.q_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.k_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.v_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.q_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.k_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.v_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.q_norm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.k_norm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.q_norm_hw.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.k_norm_hw.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.q_norm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.k_norm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.q_norm_hw_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.k_norm_hw_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.o_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.self_attn.o_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.input_layernorm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.post_attention_layernorm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.input_layernorm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.post_attention_layernorm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.mlp.gate_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.mlp.up_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.mlp.down_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.mlp_mot_gen.gate_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.mlp_mot_gen.up_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.2.mlp_mot_gen.down_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.q_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.k_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.v_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.q_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.k_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.v_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.q_norm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.k_norm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.q_norm_hw.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.k_norm_hw.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.q_norm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.k_norm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.q_norm_hw_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.k_norm_hw_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.o_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.self_attn.o_proj_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.input_layernorm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.post_attention_layernorm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.input_layernorm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.post_attention_layernorm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.mlp.gate_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.mlp.up_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.mlp.down_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.mlp_mot_gen.gate_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.mlp_mot_gen.up_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.3.mlp_mot_gen.down_proj.weight": "model-00006-of-00016.safetensors",
    "language_model.model.norm.weight": "model-00006-of-00016.safetensors",
    "language_model.model.norm_mot_gen.weight": "model-00006-of-00016.safetensors",
    "language_model.lm_head.weight": "model-00006-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.q_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.k_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.v_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.q_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.k_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.v_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.q_norm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.k_norm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.q_norm_hw.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.k_norm_hw.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.q_norm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.k_norm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.q_norm_hw_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.k_norm_hw_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.o_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.self_attn.o_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.input_layernorm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.post_attention_layernorm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.input_layernorm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.post_attention_layernorm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.mlp.gate_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.mlp.up_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.mlp.down_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.mlp_mot_gen.gate_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.mlp_mot_gen.up_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.4.mlp_mot_gen.down_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.q_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.k_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.v_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.q_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.k_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.v_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.q_norm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.k_norm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.q_norm_hw.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.k_norm_hw.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.q_norm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.k_norm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.q_norm_hw_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.k_norm_hw_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.o_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.self_attn.o_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.input_layernorm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.post_attention_layernorm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.input_layernorm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.post_attention_layernorm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.mlp.gate_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.mlp.up_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.mlp.down_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.mlp_mot_gen.gate_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.mlp_mot_gen.up_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.5.mlp_mot_gen.down_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.q_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.k_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.v_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.q_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.k_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.v_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.q_norm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.k_norm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.q_norm_hw.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.k_norm_hw.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.q_norm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.k_norm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.q_norm_hw_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.k_norm_hw_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.o_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.self_attn.o_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.input_layernorm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.post_attention_layernorm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.input_layernorm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.post_attention_layernorm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.mlp.gate_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.mlp.up_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.mlp.down_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.mlp_mot_gen.gate_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.mlp_mot_gen.up_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.6.mlp_mot_gen.down_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.q_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.k_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.v_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.q_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.k_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.v_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.q_norm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.k_norm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.q_norm_hw.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.k_norm_hw.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.q_norm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.k_norm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.q_norm_hw_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.k_norm_hw_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.o_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.self_attn.o_proj_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.input_layernorm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.post_attention_layernorm.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.input_layernorm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.post_attention_layernorm_mot_gen.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.mlp.gate_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.mlp.up_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.mlp.down_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.mlp_mot_gen.gate_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.mlp_mot_gen.up_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.7.mlp_mot_gen.down_proj.weight": "model-00007-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.q_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.k_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.v_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.q_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.k_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.v_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.q_norm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.k_norm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.q_norm_hw.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.k_norm_hw.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.q_norm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.k_norm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.q_norm_hw_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.k_norm_hw_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.o_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.self_attn.o_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.input_layernorm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.post_attention_layernorm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.input_layernorm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.post_attention_layernorm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.mlp.gate_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.mlp.up_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.mlp.down_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.mlp_mot_gen.gate_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.mlp_mot_gen.up_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.8.mlp_mot_gen.down_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.q_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.k_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.v_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.q_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.k_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.v_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.q_norm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.k_norm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.q_norm_hw.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.k_norm_hw.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.q_norm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.k_norm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.q_norm_hw_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.k_norm_hw_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.o_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.self_attn.o_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.input_layernorm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.post_attention_layernorm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.input_layernorm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.post_attention_layernorm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.mlp.gate_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.mlp.up_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.mlp.down_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.mlp_mot_gen.gate_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.mlp_mot_gen.up_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.9.mlp_mot_gen.down_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.q_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.k_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.v_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.q_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.k_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.v_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.q_norm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.k_norm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.q_norm_hw.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.k_norm_hw.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.q_norm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.k_norm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.q_norm_hw_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.k_norm_hw_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.o_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.self_attn.o_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.input_layernorm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.post_attention_layernorm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.input_layernorm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.post_attention_layernorm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.mlp.gate_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.mlp.up_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.mlp.down_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.mlp_mot_gen.gate_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.mlp_mot_gen.up_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.10.mlp_mot_gen.down_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.q_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.k_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.v_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.q_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.k_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.v_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.q_norm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.k_norm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.q_norm_hw.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.k_norm_hw.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.q_norm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.k_norm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.q_norm_hw_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.k_norm_hw_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.o_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.self_attn.o_proj_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.input_layernorm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.post_attention_layernorm.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.input_layernorm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.post_attention_layernorm_mot_gen.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.mlp.gate_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.mlp.up_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.mlp.down_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.mlp_mot_gen.gate_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.mlp_mot_gen.up_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.11.mlp_mot_gen.down_proj.weight": "model-00008-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.q_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.k_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.v_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.q_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.k_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.v_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.q_norm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.k_norm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.q_norm_hw.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.k_norm_hw.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.q_norm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.k_norm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.q_norm_hw_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.k_norm_hw_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.o_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.self_attn.o_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.input_layernorm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.post_attention_layernorm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.input_layernorm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.post_attention_layernorm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.mlp.gate_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.mlp.up_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.mlp.down_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.mlp_mot_gen.gate_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.mlp_mot_gen.up_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.12.mlp_mot_gen.down_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.q_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.k_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.v_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.q_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.k_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.v_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.q_norm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.k_norm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.q_norm_hw.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.k_norm_hw.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.q_norm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.k_norm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.q_norm_hw_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.k_norm_hw_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.o_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.self_attn.o_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.input_layernorm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.post_attention_layernorm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.input_layernorm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.post_attention_layernorm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.mlp.gate_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.mlp.up_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.mlp.down_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.mlp_mot_gen.gate_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.mlp_mot_gen.up_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.13.mlp_mot_gen.down_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.q_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.k_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.v_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.q_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.k_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.v_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.q_norm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.k_norm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.q_norm_hw.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.k_norm_hw.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.q_norm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.k_norm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.q_norm_hw_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.k_norm_hw_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.o_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.self_attn.o_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.input_layernorm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.post_attention_layernorm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.input_layernorm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.post_attention_layernorm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.mlp.gate_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.mlp.up_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.mlp.down_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.mlp_mot_gen.gate_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.mlp_mot_gen.up_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.14.mlp_mot_gen.down_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.q_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.k_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.v_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.q_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.k_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.v_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.q_norm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.k_norm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.q_norm_hw.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.k_norm_hw.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.q_norm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.k_norm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.q_norm_hw_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.k_norm_hw_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.o_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.self_attn.o_proj_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.input_layernorm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.post_attention_layernorm.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.input_layernorm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.post_attention_layernorm_mot_gen.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.mlp.gate_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.mlp.up_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.mlp.down_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.mlp_mot_gen.gate_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.mlp_mot_gen.up_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.15.mlp_mot_gen.down_proj.weight": "model-00009-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.q_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.k_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.v_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.q_proj_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.k_proj_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.v_proj_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.q_norm.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.k_norm.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.q_norm_hw.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.k_norm_hw.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.q_norm_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.k_norm_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.q_norm_hw_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.k_norm_hw_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.o_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.self_attn.o_proj_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.input_layernorm.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.post_attention_layernorm.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.input_layernorm_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.post_attention_layernorm_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.mlp.gate_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.mlp.up_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.mlp.down_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.mlp_mot_gen.gate_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.mlp_mot_gen.up_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.16.mlp_mot_gen.down_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.q_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.k_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.v_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.q_proj_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.k_proj_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.v_proj_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.q_norm.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.k_norm.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.q_norm_hw.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.k_norm_hw.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.q_norm_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.k_norm_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.q_norm_hw_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.k_norm_hw_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.o_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.self_attn.o_proj_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.input_layernorm.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.post_attention_layernorm.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.input_layernorm_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.post_attention_layernorm_mot_gen.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.mlp.gate_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.mlp.up_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.mlp.down_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.mlp_mot_gen.gate_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.mlp_mot_gen.up_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.17.mlp_mot_gen.down_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.18.self_attn.q_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.18.self_attn.k_proj.weight": "model-00010-of-00016.safetensors",
    "language_model.model.layers.18.self_attn.v_proj.weight": "model-00010-of-00016.safetensors",
